Revit 2026 API

# SiteSubRegionCreate(Document, IListCurveLoop, ElementId) Method

---

**Note: This API is now obsolete.**

**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
[ObsoleteAttribute("This method is deprecated in Revit 2024 with the introduction of the new Toposolid elements.  It is recommended that Toposolid elements should be used in place of TopographySurface elements.")]
public static SiteSubRegion Create(
	Document document,
	IList<CurveLoop> curveLoops,
	ElementId hostTopoSurfaceId
)
```
```vb
<ObsoleteAttribute("This method is deprecated in Revit 2024 with the introduction of the new Toposolid elements.  It is recommended that Toposolid elements should be used in place of TopographySurface elements.")>
Public Shared Function Create (
	document As Document,
	curveLoops As IList(Of CurveLoop),
	hostTopoSurfaceId As ElementId
) As SiteSubRegion
```
```cpp
public:
[ObsoleteAttribute(L"This method is deprecated in Revit 2024 with the introduction of the new Toposolid elements.  It is recommended that Toposolid elements should be used in place of TopographySurface elements.")]
static SiteSubRegion^ Create(
	Document^ document,
	IList<CurveLoop^>^ curveLoops,
	ElementId^ hostTopoSurfaceId
)
```
```fsharp
[<ObsoleteAttribute("This method is deprecated in Revit 2024 with the introduction of the new Toposolid elements.  It is recommended that Toposolid elements should be used in place of TopographySurface elements.")>]
static member Create :
        document : Document *
        curveLoops : IList<CurveLoop> *
        hostTopoSurfaceId : ElementId -> SiteSubRegion
```

#### Parameters

document Document

curveLoops IListCurveLoop

hostTopoSurfaceId ElementId

#### Return Value

SiteSubRegion

#### Reference

SiteSubRegion Class

Create Overload

Autodesk.Revit.DB.Architecture Namespace